x=38
print('дратути')
if x<0:
 print('меньше нуля')
 print('дотвиданиә !')
# примеры
a, b = 10, 5
if a>b:
 print('a>b')
if a>b and a>0:
 print('успех')
if (a>b) and (a>0 or 1000):
 print('успех')
if 5<b and b>10:
 print('успех')
# сравнение различных типов данных
if'35'>'123':
 print('успех')
 if '123'>'12':
     print('успех')
if [1, 2] > [1, 1]:
    print('ecgt!')
# что нельзя сравнивать-  разные типы
if '6'>5:
    print('успих')
    if[5,6]>5:
    print('испух')
       # НО
if '6'!=5:
 print('успаз')